package com.blockwit.learn1.wyuss;

public class S7T4 {
    //+1. Написать класс ProtoList1 в котором будет поле array типа массив целых чисел.
    // 2. Написать метод create который принимает размер и создает и присваивает полю array пустой массив целых чисел указанного размера.
    //    - создает и писваевает полю аrray пустой массив целых чисел указанного размера.
    //    - принимает размер
    // 3. Написать метод getSize который возращает длину массива в поле array.
    //    - принимает длину массива
    //    - возвращает длину массива в поле аррай
    // 4. Написать метод get, который принимает индекс и возращает элемент из массива array по указанному индексу.
    //  - принимает индекс
    //  - возвращает элемент из массива аррай по указанному индексу
    //
}
