package com.blockwit.learn1.wyuss;

public class TaskS8T1_T2_T3_T4 {
    /*TaskS8T1 1.
    Написать класс MyIntArrayList. Этот класс будет представлять собой список.
    Этот класс должен иметь методы:
    1. add - добавляет элемент в конец списка. Возвращает индекс, по которому элемент добавлен.
    2. get - получает индекс и возвращает соответствующий индексу элемент.
    3. size - возращает длину списка.
    4. clear - очищает список

    Важно: мы проходили список и знаем что он отличается от обычного массива тем,
    что у него нет фиксированой заранее длины. Длина списка равна кол-ву элементов в нем.
        Именно так должен работать Ваш список.

    Вы уже писали ProtoList1 на базе массива.
    Но там у нас при очередном добавлении массив мог переполнится.
    Ваша задача сделать так чтобы в новом списке такой проблемы не было.
    На последнем семинаре я давал намек как это сделать и вроде даже немного в коде показал.
    Но по возможности додумайтесь сами.

    👉TaskS8T2 2.
    Добавить в PrintHelper метод printInList, который бы распечатывал все числа списка из задачи 1.

    👉TaskS9T3
    Найти как генерировать произвольное целое число.
    Сгенерированные числа добавить в список созданный на основе класса из первой задачи.
    Распечатать с помощью метода из задачи 2.

    👉TaskS8T4
    Найти как получить время в формате миллисекунд (unix timestamp).
    Написать класс ListsEvaluation , который содержит метод evalMyList.
    Который ринимает на вход пустой список из задачи 1.
    Затем наполняет список миллионом произвольных элементов и замеряет время за которое он это сделад.
    Затем выводит это время.

     */
}
